doom/config.org
#+TITLE: Doom Emacs Configuration
#+PROPERTY: header-args :tangle config.el

* Introduction

My Doom Emacs configuration.

Re-tangle with =C-c C-v t=.

Local refresh with =C-c C-c= on org title.

** Update Repository

You can ignore this I just have it here so I can quickly update my dotfiles repository.

#+begin_src shell :eval no :tangle no
rm -r ~/Desktop/dotfiles/doom/*
cp -r ~/.config/doom/* ~/Desktop/dotfiles/doom
#+end_src

* Install Extra Packages

These are additional packages that I use.

#+begin_src emacs-lisp :results none :tangle packages.el
(package! wgsl-mode) ;; web gpu graphics shading language
(package! good-scroll) ;; better scrolling
(package! darktooth-theme) ;; theme
(package! gptel) ;; ai assistant
(package! lorem-ipsum) ;; fill paragraphs with lorem ipsum
(package! platformio-mode) ;; embedded programming platform
(package! benchmark-init) ;; benchmark emacs startup time
(package! indent-bars
  :recipe (:host github :repo "jdtsmith/indent-bars"))
(package! org-roam-ui)
#+end_src

* Custom
** Functions
These are some custom utility functions that I've created because I find use for them.

*** jecs/toggle-quote-lines

This function wraps a selected region with double quote ="= symbols.

#+begin_src emacs-lisp :results none
(defun jecs/toggle-quote-lines (beg end)
  "Toggle wrapping all items in region with double quotes."
  (interactive (list (mark) (point)))
  (unless (region-active-p)
    (user-error "No region to wrap"))
  (let ((deactivate-mark nil)
        (replacement (string-join
                      (mapcar (lambda (item)
                                (if (string-match-p "^\".*\"$" item)
                                    (string-trim item "\"" "\"")
                                  (format "\"%s\"" item)))
                              (split-string (buffer-substring beg end) "\n"))
                      "\n")))
    (delete-region beg end)
    (insert replacement)))
#+end_src

*** jecs/stare

This function opens an image and maximizes it in a new buffer.

#+begin_src emacs-lisp :results none
(defun jecs/stare ()
  "Opens random image from predefined list."
  (interactive)
  (let ((image-list '("~/Pictures/o_o/Gregory.png"
                      "~/Pictures/o_o/hamsterStare.png"
                      "~/Pictures/o_o/monkaStare.png"
                      "~/Pictures/o_o/Stare.png"
                      "~/Pictures/o_o/crunchy-cat-luna.png"
                      "~/Pictures/o_o/mikeStare.png")))
    (ffap (nth (random (length image-list)) image-list)))
  (image-transform-fit-to-window))
#+end_src

*** jecs/listening

This function opens a gif, maximizes it, and enables animation, in a new buffer.

#+begin_src emacs-lisp :results none
(defun jecs/listening (arg)
  "Opens listening gif. When ARG is non-nil, will open not-listening gif."
  (interactive "P")
  (ffap
   (if arg
       "~/Pictures/library/not-listening.gif"
     "~/Pictures/library/listening.gif"))
  (image-transform-fit-to-window)
  (image-toggle-animation)
  (message "%s" arg))
#+end_src

** Keybinds

These are some misc keybinds that I use.

#+begin_src emacs-lisp :results none
;; custom keybinds
(map! :leader
      (:prefix-map ("j" . "jecs")
       :desc "Stare" "s" #'jecs/stare
       :desc "Listening" "l" #'jecs/listening
       :desc "Open Phone" "p" #'scrcpy-open))

;; global keybinds
(map! :leader
      (:prefix-map ("x" . "global")
       :desc "Duplicate Line/Region" "d" #'duplicate-dwim))
#+end_src

** General

#+begin_src emacs-lisp :results none
;; scroll the compilation buffer
(setq compilation-scroll-output t)
(setq compilation-scroll-output 'first-error)

(setq user-full-name "Joshua Carrasco"
      user-mail-address "mail@joshuacarrasco.com")

(setq-default delete-by-moving-to-trash t)

(setq display-line-numbers-type t)

(setq org-directory "~/org/")

;; frame title
(set-frame-name "emacs btw")

;; dont ask me
(setq confirm-kill-emacs nil
      confirm-kill-processes nil)

(setq-default tab-width 4)

;; so cross program copy paste will add to kill ring
(setq save-interprogram-paste-before-kill t)

;; default font was "Source Code Pro"
;; font installed from https://github.com/protesilaos/iosevka-comfy
(set-frame-font "Iosevka Comfy Wide 11" nil t)
;; (set-frame-font "Source Code Pro 11" nil t)

;; set initial size
(when window-system
  (set-frame-size (selected-frame) 136 50))

(map! :desc "Repeat" :g "C-." #'repeat)

;; enable profiler when ran emacs with
;; emacs --debug-init
(when init-file-debug
  (require 'benchmark-init)
  (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))

(set-frame-parameter nil 'alpha-background 98)
(add-to-list 'default-frame-alist '(alpha-background . 98))
#+end_src

** Doom Dashboard

My doom dashboard configuration.

