doom/config.el
(defun jecs/toggle-quote-lines (beg end)
  "Toggle wrapping all items in region with double quotes."
  (interactive (list (mark) (point)))
  (unless (region-active-p)
    (user-error "No region to wrap"))
  (let ((deactivate-mark nil)
        (replacement (string-join
                      (mapcar (lambda (item)
                                (if (string-match-p "^\".*\"$" item)
                                    (string-trim item "\"" "\"")
                                  (format "\"%s\"" item)))
                              (split-string (buffer-substring beg end) "\n"))
                      "\n")))
    (delete-region beg end)
    (insert replacement)))

(defun jecs/stare ()
  "Opens random image from predefined list."
  (interactive)
  (let ((image-list '("~/Pictures/o_o/Gregory.png"
                      "~/Pictures/o_o/hamsterStare.png"
                      "~/Pictures/o_o/monkaStare.png"
                      "~/Pictures/o_o/Stare.png"
                      "~/Pictures/o_o/crunchy-cat-luna.png"
                      "~/Pictures/o_o/mikeStare.png")))
    (ffap (nth (random (length image-list)) image-list)))
  (image-transform-fit-to-window))

(defun jecs/listening (arg)
  "Opens listening gif. When ARG is non-nil, will open not-listening gif."
  (interactive "P")
  (ffap
   (if arg
       "~/Pictures/library/not-listening.gif"
     "~/Pictures/library/listening.gif"))
  (image-transform-fit-to-window)
  (image-toggle-animation)
  (message "%s" arg))

;; custom keybinds
(map! :leader
      (:prefix-map ("j" . "jecs")
       :desc "Stare" "s" #'jecs/stare
       :desc "Listening" "l" #'jecs/listening
       :desc "Open Phone" "p" #'scrcpy-open))

;; global keybinds
(map! :leader
      (:prefix-map ("x" . "global")
       :desc "Duplicate Line/Region" "d" #'duplicate-dwim))

;; scroll the compilation buffer
(setq compilation-scroll-output t)
(setq compilation-scroll-output 'first-error)

(setq user-full-name "Joshua Carrasco"
      user-mail-address "mail@joshuacarrasco.com")

(setq-default delete-by-moving-to-trash t)

(setq display-line-numbers-type t)

(setq org-directory "~/org/")

;; frame title
(set-frame-name "emacs btw")

;; dont ask me
(setq confirm-kill-emacs nil
      confirm-kill-processes nil)

(setq-default tab-width 4)

;; so cross program copy paste will add to kill ring
(setq save-interprogram-paste-before-kill t)

;; default font was "Source Code Pro"
;; font installed from https://github.com/protesilaos/iosevka-comfy
(set-frame-font "Iosevka Comfy Wide 11" nil t)
;; (set-frame-font "Source Code Pro 11" nil t)

;; set initial size
(when window-system
  (set-frame-size (selected-frame) 136 50))

(map! :desc "Repeat" :g "C-." #'repeat)

;; enable profiler when ran emacs with
;; emacs --debug-init
(when init-file-debug
  (require 'benchmark-init)
  (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))

(set-frame-parameter nil 'alpha-background 98)
(add-to-list 'default-frame-alist '(alpha-background . 98))

(let ((banners '(("           ▓█▓███████████▓███▓▓▓▓▓████▓▓▓▓█▓█▓███▓▓█▓▓█▓▓█▓▒░▒▒▒▓█▓▓▒▓████    
           ██▒███████████▓██▓▓▓█▒▒▓████▓▓▓▓▓▓████▓▓██▓▓█▒░░░░░░░░░▓█▓▓▓███░   
          ▒██▓▓██████████▓██▓▓▓▓▓█▓▒▒▓▓▓▒▓▒▓▓█████▓███▓░░▒▓█████▒░▒█▓▓▓███▒   
          ███▓▓█████████████▓▓█▓▓████▓▓▓▒▒█▓▓█████▓██▒░▒██▓▒▒████▒██▒▓▓███▒   
         ▒███▓████████████▓█▓▓█▓▓█████████▓█▓▓█████▓█░▓█▒░░░▒███████▒▓▓███▓   
        ░███▓▓▓███████████▓█▓▓█▓▓█▓▓▓▓▓▓▓████▓▓████▓▓▓█░▒░░░░░▒░████▒▓▓▓███   
        ▓███▓▒▓▓██████████▓█▒███▓█▓██▓▓▓███████▓███▓██▒░░░▒▓░░▓▓████▓▓▓▓███   
      ░▓██▓▓▒▓▓▓██████████▓▓▒████▒░░░░░░░▒██████▓▓██▓█▒▒▒▒▒▒▒▓▒█████▓▒▓▓███   
     ▒██▓▓▓▒▒▒▓▓███████████▒▓██▒░░▒▒▓▓▓▓▒▒▒██████▓▓█▓██▓▒▒▒▒▒▓▓▓█████▒▓▓█▓█░  
            ▓▓▓▓███████████▒▓▒░░▓███▓▒▒▓███████████▓▓████████████████▒▓▓█▓█░  
            ▓▒▓▒███████████▓░░▓███▒░░░███████████████████████████████▓▒▓█▓█░  
            ▒▓▒▓▓█████████▓▓░▓██▓░▒░░▒▒▓▒▓████████████████████████████▒▓▓▓█░  
           ░▒▓░▓▓████████▓▓▓▓██▓░▒░░▒▒░▒▒▓████████████████████████████▒▓▓▓█░  
            ██▒▒▓█████████▓▓▓██░░░░▒▒▒▓▒▒████████████▓▓███████████████▓▒▓▓█▒  
           ░█▓▓▒▒███████████▓▓█░░░▒▒▓▓▒▒▓████████████▓▓▓███████████████▒▓▓█▒  
           ░█▓▓▒▒████████████▓█▒▒▓▓▒▒▓████████████████▓▓███████████████▒▓▓▓▒  
           ▒▓▓▓▒▒▓███████████▓████▓▓██████████████████▓▓███████████████▒▓▓▓▒  
           ▒▒█▓▒▒▓████████████▓███▓████████████████████████████████████▒▓▓▓░  
           ▒█▓▓▒▓▓▓████████▓███▓██████████████████████████████████████▒▓▓▓█░  
          ░▓█▓▓▒▓▓▒████████▓███▓█████████████████████████████████████▓▒▓▒▓█░  
          ▒██▓▓▒▓▓▒▓███████▓▓██▓█████████████████████████████████████▒▓▓▒▓█   
         ░▓██▓▒▓▓▓▒▓████████▓███▓███████████████████████████▓███████▒▓▓▓▒▒▓   
         ▒▓█▓▓▒▓▓▓▒▒████████▓▓██▓██████████████████████▓▓▓▓▓▓▓█████▓▒▓▓▓▒▒▓░  
         ▓██▓▓▒▓▓▓▒▓▓███████▓▓██▓▓█████████████████▓▓▓▓███████████▓▒▓▓▓▓▒▒▓▒░ 
        ▒▓██▓▒▓▓▓▒▓▓▒█▓██████▓▓██▓███████████▓█▓██▓███████████████▒▓▓▓▒▒▒▒▒█░ 
        ▓▓██▓▒▓▓▓▒▓▓▒▓▓▓█████▓▓██▓███████████▓▓█▓▓███████████████▓▒▒▒▒▒▒▒░▓█▓ 
        ▓██▓▓▒▓▓▓▒▓▓▓▒█▓█████▓▓▓██▓██████████▓██████████████████▓█▓▒▒▒▒▒░▒▓█▓▒
       ▒▓██▓▒▒▓▓▓▒▓▓▓▒▓▓▓███▓▓▓▓▓▓▓████████████████████████████▓██▓▒▒▒▒▒▒▓▓██▓
       ▒▓██▓▒▓▓▓▓▒▓▓▓▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓██████████████████████████▒███▓▒▒▒▒▒▓▓▓██▓
      ░▓███▓▒▓▓▓▓▒▒▒▓██▓▓▓▓▓▓▓▓▓▓▓▓▒▓████████████████████████▒▒███▓▒▒▒▒▒▓▒███▓
      ▒▓▓▓▓▓▒▓▒▓▓░░████▓▓▓▓▓▓▓▓▓▓▓▓▓░▒▓████████████████████▓░▒▒████▒▒▒▒▒█▒███▓
      ▒▓▓▓▓▓▒▒▓▒░░░░████▓▓▓▓▓▓▓▓▓▓▒▓░░░▒▓█████████████████▒░▒▒▒████░▒▒▒▒█▓██▓▒
") ("            ████████        ████████  ████                                  
            ██▓▓▒▒▓▓████  ██        ██    ██              ██████████        
            ██▒▒████▓▓▓▓██    ░░    ░░      ██  ██████████▒▒▒▒▓▓▒▒██        
            ██▓▓██░░████  ░░░░░░░░░░░░░░      ██▓▓▓▓▒▒▒▒▒▒▒▒████▒▒██        
              ████░░██  ░░████████████░░░░░░░░  ▓▓▓▓▓▓▓▓████░░██▓▓██        
                ████  ░░▓▓▓▓▓▓▓▓████▓▓▓▓██▓▓░░░░▒▒██▓▓██▒▒▒▒░░██▓▓▓▓        
                  ██░░▓▓▒▒▓▓▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓░░░░░░██░░░░  ██▓▓▓▓          
                ██  ██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓████░░░░██░░░░██▓▓██          
                ██░░██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓██░░██░░██▓▓██            
                  ██▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓██░░██▓▓██              
                ██▒▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓██░░██████              
                ██▒▒▒▒▒▒▓▓▓▓▒▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓██▓▓▓▓██              
                ██▒▒▒▒▒▒▓▓██▒▒▒▒▒▒▒▒▓▓▒▒▒▒▒▒▓▓▒▒▒▒▒▒▓▓▓▓▓▓▓▓██              
                ██▒▒▒▒▒▒▓▓██▒▒▒▒▒▒▓▓▓▓▒▒▒▒▒▒▓▓▒▒▒▒▒▒▓▓▓▓▓▓▓▓██              
                ██▒▒▒▒▓▓████▒▒▒▒▒▒▓▓██▒▒▒▒▓▓▓▓▒▒▒▒▒▒▓▓▓▓▓▓▓▓██              
                  ██████░░░░██▒▒▒▒▓▓██▒▒▒▒▓▓██▒▒▒▒▒▒▓▓▓▓▓▓▓▓██              
                ██▓▓██▓▓▓▓▓▓░░██████░░██████▓▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓██              
                ██▓▓██  ▒▒▒▒░░░░░░░░▓▓▓▓▓▓▒▒██▒▒▒▒▓▓▓▓▓▓▓▓▓▓██              
                ██▓▓▓▓░░░░░░░░░░░░░░  ▒▒▒▒░░▓▓▒▒▒▒▓▓▓▓▓▓▓▓██                
                ██▒▒██░░          ░░░░░░░░██▒▒▒▒▓▓▓▓▓▓▓▓▓▓██                
                ██▒▒▓▓██    ▓▓░░        ░░██▒▒▒▒▓▓▓▓▓▓▓▓▓▓██                
                  ██▒▒██                ██▒▒▒▒▓▓▓▓▓▓▓▓▓▓██                  
                  ██▒▒██░░    ▒▒▒▒      ░░████▓▓▓▓▓▓▓▓██                    
                    ██▓▓██    ░░░░    ░░██░░██▒▒▓▓▓▓██                      
                    ██▒▒▓▓▓▓▓▓      ░░▓▓▒▒▓▓▒▒▒▒████                        
                  ██  ██▓▓██░░████████░░░░██████                            
                ██  ░░░░████  ██░░██    ░░░░██                              
              ██    ░░▓▓░░░░████░░░░██    ██░░▓▓██    ██████                
              ██  ▒▒░░▓▓░░▓▓▓▓▓▓██▓▓██▓▓▓▓░░░░░░░░▓▓██░░░░░░██              
            ██  ░░░░▓▓░░▓▓▓▓▓▓██▓▓██▓▓▓▓██░░░░░░░░░░██  ░░░░██              
              ██  ░░██░░██████░░██▓▓▓▓████░░░░  ░░██    ░░░░░░██            
            ██▓▓██░░██░░░░░░░░░░░░██▓▓██░░░░    ░░██  ░░░░████              
") ("                                           ░░░                                
                                       ░░░░ ░░░░░                             
                                      ░░░░░░░░░░░░                            
                                     ░░░░░▒▒▒░░░░░░░░░                        
                                    ░░░░▒▒▒▒░░░░░░░  ░                        
                                   ░░░░░▒▒▒░▒░░▒░░░░                          
                                   ▒░░░░░▒░▒░░░▒▒░▒░▒░░                       
                               ░▒▒░░  ░░░░░░░░░▒░▒▒▒░▒░                       
                               ░░░░   ░  ░░░▒░░░░░░▒░▒▒                       
                            ▒▓▓▓▓▓▓▒  ░  ░░░░░░░░░░░▒░▒                       
                          ░▓▓▓▓▓▓▓▓▒▒   ░░░░░  ▒ ░░░▒░▒░                      
                         ░▓▓▓▓▓▓▓▓▓▒    ░▒░░░░ ▒ ░ ░░░░░                      
                         ▓▓▓▒▒▓▓▓▓▓░    ▒▓░░▒░░░░░░ ░░░░                      
                        ▓▓▓▓▒  ░░▒▒  ░░ ▒▒▒▓▓▒░ ░▒     ░                      
                       ░▓▓▓▒   ░░▒░ ░░░░▒▓▓▓▓▓░▒░                             
                       ▓▓▓▓   ░ ░░  ▒░▒░▓▓▓▓▓▓▓▒░░                            
                      ▒▓▓▓▒     ░  ░░▒▒░▓▓▓▓▓▓▓▓░                             
                     ░▓▓▓▓      ░  ░░ ▒▒▓▓▓▓▓▓▓▓▒                             
                     ▓▓▓▓▒     ░░  ░  ▒▒▓▓▓▒░▒▓▓░                             
                    ▒▓▓▓▓     ░░   ░  ▒▒▓▓▓▓▒▓▓▒   ░                          
                    ▓▓▓▓▒    ░        ▒▒▒▓▓▓▓▓▒    ▒                          
                   ▒▓▓▓▓░    ░       ░▒▒▒▒▒▓▒  ░░░ ░                          
                   ▓▓▓▓▒    ░        ▒▒▒▒▒░   ░▒░░  ░                         
                  ▒▓▓▓▓░   ░░       ▒▒▒▒▒▒░   ░▒░ ░                           
                  ▓▓▓▓▓ ░ ░░░▒▓    ▒▓▓▒▒▒▒░   ░▒░ ░                           
                 ▒▓▓▓▓▒▓▓▓▓▓▓▓▓ ░  ░▓▓▒▒▒▒▒░  ░▒░                             
                 ▓▓▓▓▓▓▓▓▓▓▓▓▓▓ ░   ▓▓▓▓▒▒▒▒▒ ░▒                              
                ░▓▓▓▓▒▓▓▓▓▓▓▓▓▓ ▒░  ░▓▓▓▓▓▓▓▒░ ░░                             
                ▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓ ░▓░  ░▓▓▓▓▓▓▒▒ ░▒▓▒                           
                 ▒▓▓▓▓▓▓▓▓▒▒▒▒▒░░▓▓▒  ░▓▓▓▓▓░▒ ░░▓▓▒                          
                  ░░░░░░░░░░░▒▒░▒▒▓▓▓░░░▓▓▓▓░▒░ ░▒▓▓                          
                ░░░░   ░     ░▒▒░▓▓▓▓▓▓░▒▓▓▓░▒▓░ ░▓▓▓                         
              ░░░           ░░▒▓▓▒▓▓▓▓▓▓░▒▓▓░░▓▓░ ░▓▓░                        
"))))
