doom/config.org
*** Set banner

A pool of ASCII arts that will be randomly chosen from for the dashboard.

#+name: tangled/banners
#+begin_src elisp :tangle no :results none
(list (list (f-read-text "./asciis/aqua.txt"))
      (list (f-read-text "./asciis/maid.txt"))
      (list (f-read-text "./asciis/rias.txt")))
#+end_src

#+begin_src emacs-lisp :tangle yes :var banners=tangled/banners :results none
(defvar jecs/banners banners)
#+end_src

Set doom dashboard by picking a random ascii.

#+begin_src emacs-lisp :results none 
(setq +doom-dashboard-ascii-banner-fn
      (lambda ()
        (let* ((banner (nth (random (length jecs/banners)) jecs/banners))
               (longest-line (apply #'max (mapcar #'length banner))))
          (put-text-property
           (point)
           (dolist (line banner (point))
             (insert (+doom-dashboard--center
                      +doom-dashboard--width
                      (concat line (make-string (max 0 (- longest-line (length line))) 32)))
                     "\n"))
           'face 'doom-dashboard-banner))))
#+end_src

*** Benchmark

Override default =doom-display-benchmark-h= function with different formatting.

#+begin_src emacs-lisp :results none
(defun doom-display-benchmark-h (&optional return-p)
  "Display a benchmark including number of packages and modules loaded.

If RETURN-P, return the message as a string instead of displaying it."
  (funcall (if return-p #'format #'message)
           "Loaded %d packages in %.03fs"
           (- (length load-path) (length (get 'load-path 'initial-value)))
           doom-init-time))
#+end_src

*** Dashboard functions

Remove the footer widget from the dashboard.

#+begin_src emacs-lisp :results none
(setq +doom-dashboard-functions
      '(doom-dashboard-widget-banner
        doom-dashboard-widget-shortmenu
        doom-dashboard-widget-loaded))
        ;; doom-dashboard-widget-footer
#+end_src

*** Sections

Remove some sections from the dashboard.

#+begin_src emacs-lisp :results none
(setq +doom-dashboard-menu-sections (cl-subseq +doom-dashboard-menu-sections 0 2))
#+end_src

*** Other

Other small changes.

#+begin_src emacs-lisp :results none
;; disable hl line on dashboard
(add-hook! '+doom-dashboard-functions
  (setq hl-line-mode nil)
  (hide-mode-line-mode 1))

;; override function to remove newlines at start
(defun doom-dashboard-widget-loaded ()
  "Overrides doom dashboard loaded function."
  (when doom-init-time
    (insert
     ""
     (propertize
      (+doom-dashboard--center
       +doom-dashboard--width
       (doom-display-benchmark-h 'return))
      'face 'doom-dashboard-loaded)
     "\n")))
#+end_src

* Theme

Set theme and customize faces on some themes that I use.

#+begin_src emacs-lisp :results none
(setq doom-theme
      ;; 'doom-one
      ;; 'doom-old-hope
      ;; 'doom-1337
      'darktooth)
#+end_src

** Doom 1337 Customizations

#+begin_src emacs-lisp :results none
(custom-theme-set-faces! 'doom-1337
  '(mode-line :background "#476685")
  '(mode-line-inactive :background "#242628")
  '(hl-line :background "#252526"))
#+end_src

** Darktooth Customizations

The [[https://github.com/emacsfodder/emacs-theme-darktooth][darktooth theme]] is my favourite theme, but I had to make some customizations for a couple things.

#+begin_src emacs-lisp :results none
(custom-theme-set-faces! 'darktooth
  ;; all colours come from darktooh theme unless specified

  ;; so that (text-scale-adjust) scales properly
  '(line-number :inherit default :foreground "#7C6F64" "#767676")
  ;; same colour for current line
  ;; '(line-number-current-line :inherit default :foreground "#7C6F64" "#767676")
  ;; slightly different colour for current line 
  '(line-number-current-line :inherit default :foreground "#A89984" "#767676")

  ;; tab bar
  '(tab-bar-tab :background "#3a3a3a" "#3a3a3a")
  '(tab-bar-tab-inactive :background "#1c1c1c" "#1c1c1c")
  '(tab-bar :background "#1c1c1c" "#1c1c1c")

  ;; org mode
  '(org-block-begin-line :inherit 'org-block :extend t :foreground "#928374" "#8a8a8a")
  '(org-block-end-line :inherit 'org-block :extend t :foreground "#928374" "#8a8a8a")
  '(org-block :background "#232323" "#262626" :extend t)

  ;; modeline icons not bold
  '(success :foreground "#B8BB26" "#73AF00" :bold nil)
  '(error :foreground "#FB4933" "#d75f5f" :bold nil)
  '(warning :foreground "#FABD2F" "#ffaf00" :bold nil))
#+end_src

* Configure Packages
** Tree Sitter

#+begin_src emacs-lisp :results none
(use-package! tree-sitter
  :hook
  ((prog-mode . global-tree-sitter-mode)
   (tree-sitter-after-on . tree-sitter-hl-mode)))

(map!
 :after tree-sitter
 :leader
 :desc "Tree Sitter Highlight" :g "t h" #'tree-sitter-hl-mode)
#+end_src

** Treemacs

#+begin_src emacs-lisp :results none
(after! treemacs
  (treemacs-follow-mode 1))

(map! :leader :desc "Select Treemacs" :g "TAB" #'treemacs-select-window)
#+end_src

** Company

Company is a completion engine. I've been using corfu instead though.

#+begin_src emacs-lisp :results none
(after! company
  (setq company-minimum-prefix-length 1))
#+end_src

** Gptel

Gptel is a tool to interact with large language models in emacs.

I use a local llama3.

#+begin_src emacs-lisp :results none
(use-package! gptel
  :defer t
  :bind
  (("C-c o g" . #'gptel))
  :config
  (add-hook 'gptel-post-stream-hook 'gptel-auto-scroll)
  (setq gptel-model "llama3:latest"
        gptel-backend (gptel-make-ollama "Ollama"
                        :host "localhost:11434"
                        :stream t
                        :models '("llama3:latest"))))
#+end_src

** Corfu

Corfu is an in buffer completion engine.

#+begin_src emacs-lisp :results none
(after! corfu
  (unless (display-graphic-p)
    (corfu-terminal-mode +1))
  (setq corfu-auto-prefix 0))
#+end_src

** PlatformIO

[[https://github.com/ZachMassia/PlatformIO-Mode][PlatformIO]] is allows you to interact with PlatformIO Core CLI from emacs.

#+begin_src emacs-lisp :results none
(use-package! platformio-mode
  :custom
  (platformio-mode-keymap-prefix (kbd "C-c l p"))
  :init
  ;; you may be required to make a .projectile file in project root.
  (add-hook 'c-mode-hook (lambda ()
                           (lsp-deferred)
                           (platformio-conditionally-enable)))
  (add-hook 'c++-mode-hook (lambda ()
                             (lsp-deferred)
                             (platformio-conditionally-enable)))

  :config
  (which-key-add-keymap-based-replacements platformio-mode-map
   "C-c l p" '("PlatformIO" . platformio-command-map)
   "C-c l p b" '("Build Project" . platformio-build)
   "C-c l p c" '("Clean Compile Objects" . platformio-clean)
   "C-c l p u" '("Build and Upload" . platformio-upload)
   "C-c l p p" '("Programmer Upload" . platformio-programmer-upload)
   "C-c l p s" '("SPIFFS Upload" . platformio-spiffs-upload)
   "C-c l p d" '("Update" . platformio-update)
   "C-c l p m" '("Device Monitor" . platformio-device-monitor)
   "C-c l p l" '("List Boards" . platformio-boards)
   "C-c l p i" '("Update Workspace" . platformio-init-update-workspace)))
#+end_src

** TRAMP

Documentation at: https://coder.com/docs/v2/latest/ides/emacs-tramp

#+begin_src emacs-lisp :results none
;; (after! tramp
;;   (add-to-list 'tramp-remote-path 'tramp-own-remote-path))

;; (setq tramp-verbose 10)
;; (setq tramp-default-method "plink")
;; (setq tramp-remote-path '("/mnt/c/Program Files/PuTTY"))
#+end_src

** scrcpy

scrcpy is a work in progress package that I'm working on to interact with the scrcpy command line utility from emacs.

#+begin_src emacs-lisp :results none
(load! "scrcpy.el")
#+end_src

** Org

#+begin_src emacs-lisp :results none
(add-hook 'org-mode-hook 'yas-minor-mode-on)
#+end_src

** Org Hugo

#+begin_src emacs-lisp :results none
(after! ox-hugo
  :defer t
  (setq org-hugo-base-dir
        (concat org-directory "hugo")))
#+end_src

** Org Roam

#+begin_src emacs-lisp :results none
(use-package! org-roam
  :defer t
  :custom
  (org-roam-capture-templates
   '(("d" "default" plain "%?" :target
      (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags:\n")
      :unnarrowed t)
     ("m" "math" plain "#+STARTUP: latexpreview\n%?" :target
      (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Math\n")
      :unnarrowed t)
     ("p" "programming" plain "#+STARTUP: latexpreview\n%?" :target
      (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Programming\n")
      :unnarrowed t))))
#+end_src

** Org Roam UI

A fancy UI for org roam. https://github.com/org-roam/org-roam-ui

#+begin_src emacs-lisp :tangle yes
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(map!
 :after org-roam-ui
 :desc "Open Web UI" :leader "n r w" #'org-roam-ui-open)
#+end_src

** Consult

#+begin_src emacs-lisp :results none
(map! :g "C-x b" #'consult-buffer)
#+end_src

