doom/config.el
(defvar jecs/banners banners)
)

(setq +doom-dashboard-ascii-banner-fn
      (lambda ()
        (let* ((banner (nth (random (length jecs/banners)) jecs/banners))
               (longest-line (apply #'max (mapcar #'length banner))))
          (put-text-property
           (point)
           (dolist (line banner (point))
             (insert (+doom-dashboard--center
                      +doom-dashboard--width
                      (concat line (make-string (max 0 (- longest-line (length line))) 32)))
                     "\n"))
           'face 'doom-dashboard-banner))))

(defun doom-display-benchmark-h (&optional return-p)
  "Display a benchmark including number of packages and modules loaded.

If RETURN-P, return the message as a string instead of displaying it."
  (funcall (if return-p #'format #'message)
           "Loaded %d packages in %.03fs"
           (- (length load-path) (length (get 'load-path 'initial-value)))
           doom-init-time))

(setq +doom-dashboard-functions
      '(doom-dashboard-widget-banner
        doom-dashboard-widget-shortmenu
        doom-dashboard-widget-loaded))
        ;; doom-dashboard-widget-footer

(setq +doom-dashboard-menu-sections (cl-subseq +doom-dashboard-menu-sections 0 2))

;; disable hl line on dashboard
(add-hook! '+doom-dashboard-functions
  (setq hl-line-mode nil)
  (hide-mode-line-mode 1))

;; override function to remove newlines at start
(defun doom-dashboard-widget-loaded ()
  "Overrides doom dashboard loaded function."
  (when doom-init-time
    (insert
     ""
     (propertize
      (+doom-dashboard--center
       +doom-dashboard--width
       (doom-display-benchmark-h 'return))
      'face 'doom-dashboard-loaded)
     "\n")))

(setq doom-theme
      ;; 'doom-one
      ;; 'doom-old-hope
      ;; 'doom-1337
      'darktooth)

(custom-theme-set-faces! 'doom-1337
  '(mode-line :background "#476685")
  '(mode-line-inactive :background "#242628")
  '(hl-line :background "#252526"))

(custom-theme-set-faces! 'darktooth
  ;; all colours come from darktooh theme unless specified

  ;; so that (text-scale-adjust) scales properly
  '(line-number :inherit default :foreground "#7C6F64" "#767676")
  ;; same colour for current line
  ;; '(line-number-current-line :inherit default :foreground "#7C6F64" "#767676")
  ;; slightly different colour for current line 
  '(line-number-current-line :inherit default :foreground "#A89984" "#767676")

  ;; tab bar
  '(tab-bar-tab :background "#3a3a3a" "#3a3a3a")
  '(tab-bar-tab-inactive :background "#1c1c1c" "#1c1c1c")
  '(tab-bar :background "#1c1c1c" "#1c1c1c")

  ;; org mode
  '(org-block-begin-line :inherit 'org-block :extend t :foreground "#928374" "#8a8a8a")
  '(org-block-end-line :inherit 'org-block :extend t :foreground "#928374" "#8a8a8a")
  '(org-block :background "#232323" "#262626" :extend t)

  ;; modeline icons not bold
  '(success :foreground "#B8BB26" "#73AF00" :bold nil)
  '(error :foreground "#FB4933" "#d75f5f" :bold nil)
  '(warning :foreground "#FABD2F" "#ffaf00" :bold nil))

(use-package! tree-sitter
  :hook
  ((prog-mode . global-tree-sitter-mode)
   (tree-sitter-after-on . tree-sitter-hl-mode)))

(map!
 :after tree-sitter
 :leader
 :desc "Tree Sitter Highlight" :g "t h" #'tree-sitter-hl-mode)

(after! treemacs
  (treemacs-follow-mode 1))

(map! :leader :desc "Select Treemacs" :g "TAB" #'treemacs-select-window)

(after! company
  (setq company-minimum-prefix-length 1))

(use-package! gptel
  :defer t
  :bind
  (("C-c o g" . #'gptel))
  :config
  (add-hook 'gptel-post-stream-hook 'gptel-auto-scroll)
  (setq gptel-model "llama3:latest"
        gptel-backend (gptel-make-ollama "Ollama"
                        :host "localhost:11434"
                        :stream t
                        :models '("llama3:latest"))))

(after! corfu
  (unless (display-graphic-p)
    (corfu-terminal-mode +1))
  (setq corfu-auto-prefix 0))

(use-package! platformio-mode
  :custom
  (platformio-mode-keymap-prefix (kbd "C-c l p"))
  :init
  ;; you may be required to make a .projectile file in project root.
  (add-hook 'c-mode-hook (lambda ()
                           (lsp-deferred)
                           (platformio-conditionally-enable)))
  (add-hook 'c++-mode-hook (lambda ()
                             (lsp-deferred)
                             (platformio-conditionally-enable)))

  :config
  (which-key-add-keymap-based-replacements platformio-mode-map
   "C-c l p" '("PlatformIO" . platformio-command-map)
   "C-c l p b" '("Build Project" . platformio-build)
   "C-c l p c" '("Clean Compile Objects" . platformio-clean)
   "C-c l p u" '("Build and Upload" . platformio-upload)
   "C-c l p p" '("Programmer Upload" . platformio-programmer-upload)
   "C-c l p s" '("SPIFFS Upload" . platformio-spiffs-upload)
   "C-c l p d" '("Update" . platformio-update)
   "C-c l p m" '("Device Monitor" . platformio-device-monitor)
   "C-c l p l" '("List Boards" . platformio-boards)
   "C-c l p i" '("Update Workspace" . platformio-init-update-workspace)))

;; (after! tramp
;;   (add-to-list 'tramp-remote-path 'tramp-own-remote-path))

;; (setq tramp-verbose 10)
;; (setq tramp-default-method "plink")
;; (setq tramp-remote-path '("/mnt/c/Program Files/PuTTY"))

(load! "scrcpy.el")

(add-hook 'org-mode-hook 'yas-minor-mode-on)

(after! ox-hugo
  :defer t
  (setq org-hugo-base-dir
        (concat org-directory "hugo")))

(use-package! org-roam
  :defer t
  :custom
  (org-roam-capture-templates
   '(("d" "default" plain "%?" :target
      (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags:\n")
      :unnarrowed t)
     ("m" "math" plain "#+STARTUP: latexpreview\n%?" :target
      (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Math\n")
      :unnarrowed t)
     ("p" "programming" plain "#+STARTUP: latexpreview\n%?" :target
      (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Programming\n")
      :unnarrowed t))))

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(map!
 :after org-roam-ui
 :desc "Open Web UI" :leader "n r w" #'org-roam-ui-open)

(map! :g "C-x b" #'consult-buffer)

(after! god-mode
  (god-mode-all -1)
