doom/config.el
  (map! :desc "Toggle God Mode" :g "M-m" #'god-local-mode)
  (define-key god-local-mode-map (kbd ".") #'repeat)
  (define-key god-local-mode-map (kbd "C-x C-1") #'delete-other-windows)
  (define-key god-local-mode-map (kbd "C-x C-2") #'split-window-below)
  (define-key god-local-mode-map (kbd "C-x C-3") #'split-window-right)
  (define-key god-local-mode-map (kbd "C-x C-0") #'delete-window)

  (after! ace-window
    (define-key god-local-mode-map (kbd "C-x C-o") #'ace-window)))

(map! :after tab-bar :desc "Toggle Tab Bar Mode" :g "C-x t C-0" #'tab-bar-mode)

(use-package! ws-butler
  :config
  (add-to-list 'ws-butler-global-exempt-modes 'text-mode))

(use-package! mu4e
  :defer 60
  :config
  (set-email-account! "info@joshuacarrasco.com"
                      '((mu4e-sent-folder       . "/info/Sent Mail")
                        (mu4e-drafts-folder     . "/info/Drafts")
                        (mu4e-trash-folder      . "/info/Trash")
                        (mu4e-refile-folder     . "/info/All Mail")
                        (smtpmail-smtp-user     . "info@joshuacarrasco.com")
                        (mu4e-compose-signature . "---\nRegards\nJoshua"))
                      t)
  (set-email-account! "mail@joshuacarrasco.com"
                      '((mu4e-sent-folder       . "/mail/Sent Mail")
                        (mu4e-drafts-folder     . "/mail/Drafts")
                        (mu4e-trash-folder      . "/mail/Trash")
                        (mu4e-refile-folder     . "/mail/All Mail")
                        (smtpmail-smtp-user     . "mail@joshuacarrasco.com")
                        (mu4e-compose-signature . "---\nRegards\nJoshua"))
                      t)
  
  (setq +mu4e-gmail-accounts '(("mail@joshuacarrasco.com" . "/mail")
                               ("info@joshuacarrasco.com" . "/info")))
  (setq mu4e-update-interval 60)
  (setq smtpmail-smtp-server "smtp.gmail.com")
  (setq mu4e-modeline-show-global nil))

(use-package! indent-bars
  :hook ((prog-mode . indent-bars-mode))
  :custom
  (indent-bars-treesit-support t)
  (indent-bars-treesit-ignore-blank-lines-types '("module"))
  (indent-bars-width-frac 0.1)
  (indent-bars-pad-frac 0.5)
  (indent-bars-display-on-blank-lines t))

;; (after! lsp-mode
;;   (setq lsp-inlay-hint-enable t))

(defun lsp-booster--advice-json-parse (old-fn &rest args)
  "Try to parse bytecode instead of json."
  (or
   (when (equal (following-char) ?#)
     (let ((bytecode (read (current-buffer))))
       (when (byte-code-function-p bytecode)
         (funcall bytecode))))
   (apply old-fn args)))
(advice-add (if (progn (require 'json)
                       (fboundp 'json-parse-buffer))
                'json-parse-buffer
              'json-read)
            :around
            #'lsp-booster--advice-json-parse)

(defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
  "Prepend emacs-lsp-booster command to lsp CMD."
  (let ((orig-result (funcall old-fn cmd test?)))
    (if (and (not test?)                             ;; for check lsp-server-present?
             (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
             lsp-use-plists
             (not (functionp 'json-rpc-connection))  ;; native json-rpc
             (executable-find "emacs-lsp-booster"))
        (progn
          (message "Using emacs-lsp-booster for %s!" orig-result)
          (cons "emacs-lsp-booster" orig-result))
      orig-result)))
(advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)

(with-eval-after-load 'dap-mode
  (setq dap-default-terminal-kind "integrated") ;; Make sure that terminal programs open a term for I/O in an Emacs buffer
  (dap-auto-configure-mode +1))

(after! python
  (setq! lsp-pylsp-plugins-black-enabled t))

;; debugging
(after! dap-mode
  (setq dap-python-debugger 'debugpy))

(setq realgud:pdb-command-name "python3 -m pdb"
      gud-pdb-command-name "python3 -m pdb")

(after! lsp-mode
  (setq lsp-pyright-multi-root nil))

(with-eval-after-load 'lsp-mode
  (add-to-list 'lsp-language-id-configuration
               '(wgsl-mode . "wgsl"))

  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection "wgsl_analyzer")
                    :major-modes '(wgsl-mode)
                    :server-id 'wgsl-ls)))

;; (after! rustic
;;   (setq lsp-inlay-hint-enable t))

;; (after! lsp-mode
;;    (setq lsp-rust-analyzer-server-command "emacs-lsp-booster rust-analyzer"))

(after! dap-mode
  (dap-ui-mode)
  (dap-ui-controls-mode 1)

  ;; (require 'dap-lldb)
  (require 'dap-cpptools)
  ;; (require 'dap-gdb-lldb)
  ;; installs .extension/vscode
  ;; (dap-gdb-lldb-setup)
  (dap-cpptools-setup)
  (dap-register-debug-template "Rust::CppTools Run Configuration"
                               (list :type "cppdbg"
                                     :request "launch"
                                     :name "Rust::Run"
                                     :MIMode "gdb"
                                     :miDebuggerPath "rust-gdb"
                                     :environment []
                                     :program "${workspaceFolder}/target/debug/image2ascii"
                                     :cwd "${workspaceFolder}"
                                     :console "external"
                                     :dap-compilation "cargo build"
                                     :dap-compilation-dir "${workspaceFolder}")))

(setq c-basic-offset 2)

(after! (tramp lsp-mode)
  (lsp-register-client ;; c/c++ remote LSP
   (make-lsp-client :new-connection (lsp-tramp-connection "clangd")
                    :major-modes '(c-mode c++-mode)
                    :remote? t
                    :server-id 'clangd-remote)))

(after! (tramp lsp-mode)
  (lsp-register-client ;; c-sharp remote LSP
   (make-lsp-client :new-connection (lsp-tramp-connection "csharp-ls")
                    :major-modes '(csharp-mode)
                    :remote? t
                    :server-id 'csharp-ls-remote)))

(after! (tramp lsp-mode)
  (lsp-register-client ;; javascript remote LSP
   (make-lsp-client :new-connection (lsp-tramp-connection "typescript-language-server --stdio")
                    :major-modes '(rjsx-mode js2-mode typescript-mode)
                    :remote? t
                    :server-id 'ts-ls-remote)))



(when (eq system-type 'windows-nt)
  (progn
    ;; use vs code font
    (set-frame-font "Cascadia Code 12" nil t)

    ;; vterm doesnt work on windows. use eshell instead in packages.el!
    (use-package window
      :custom
      (display-buffer-alist
       ;; bottom slot -1
       '(("\\*doom:eshell-popup:.*\\*"
          (display-buffer-in-side-window)
          (window-height . 0.25)
          (side . bottom)
          (slot . -1)
          (window-parameters . ((no-delete-other-windows . t)))))))))
